export const dateDiff = ''



// Как узнать разницу между двумя датами в миллисекундах?

// const dateStart = new Date(1976, 2, 20);
// const dateEnd = new Date(2017, 6, 20);

// a) Date.now(dateEnd) - Date.now(dateStart)
// b) Невозможно без использования сторонних библиотек
// c) dateEnd.valueOf() - dateStart.valueOf() ------  !!!DONE!!!
// d) dateEnd - dateStart ------  !!!DONE!!!



// valueOf - возвращает примитивное значение объекта. Т.е. если выполняется какая-либо операция над объектом (напр. -, +, /, * и т.д.), то вызывается этот метод, если он определен.

// ({
//   valueOf() {
//     return 1;
//   },
// } + 1); // 2
// При этом, если определены оба toString и valueOf, то приоритет будет у valueOf над toString, независимо от второго операнда:

// ({
//   toString() {
//     return '1';
//   },
//   valueOf() {
//     return 2;
//   },
// } + '2'); // '22'
// А если valueOf не определен, то будет вызван toString.

// ({
//   toString() {
//     return '1';
//   },
// } + '2'); // '12'


// Таким образом, примитивным значением класса Date является количество миллисекунд 
//и метод valueOf возвращает это значение. 

//Значит, вариант с) - правильный. 
//Но так как в d) мы выполняем операцию вычитания, то valueOf вызовется автоматически, 
//а значит, и этот вариант правильный. 

//Вариант b) неправильный, потому что задачу 
//можно выполнить стандартными средствами JS. А вариант a) неправильный, 
//потому что метод Date.now() не принимает аргументов и всегда возвращает 
//количество миллисекунд, прошедших с 1 января 1970 года.

