export const refArrays = ''

// Почему при удалении одного из элементов массива arr1 одновременно изменится массив arr2?
// const arr1 = [1, 150, 3.5];
// const arr2 = arr1;
// arr2.pop();

// a) arr1 и arr2 будут ссылаться на один и тот же объект в памяти ------  !!!DONE!!!
// b) arr1 и arr2 будут разными массивами, но их методы будут синхронизированы
// c) arr2 будет дочерним объектом arr1, поэтому их значения будут изменяться одновременно
// d) arr1 и arr2 будут разными массивами, но их значения будут синхронизированы

// правильный ответ a), потому что в JS ничего само по себе не синхронизируется, 
//а наследуются друг от друга классы, а не объекты.


// a = [1, 2, 3];
// b = [1, 2, 3];
// a==b 
// false




