export const refObjects = ''


// Будут ли ссылаться obj1.prop1 и obj2.prop1 на один и тот же объект?

// const obj0 = {};
// const obj1 = {
//   prop1: obj0,
// };
// const obj2 = Object.assign({}, obj1);

// a) Да  ------  !!!DONE!!!
// b) Нет
// c) Да, но не в strict mode
// d) Фрагмент кода невозможно интерпретировать

// код валидный, а значит, вариант d) - неправильный. Режим strict также не имеет 
// никакого влияния на выполнение следующего кода, а значит, вариант c) тоже неправильный. 

// А так как мы разобрались, что при копировании объектов методом Object.assign 
// значения не копируются, то правильный ответ a), ведь свойства prop1 в обоих 
// объектах будут ссылаться на один и тот же объект в памяти.


