export const reservedkeyWords = ''


// Почему выполнение данного кода закончится с ошибкой (выберите наиболее точный ответ)?
// class New {
//   constructor(someVar) {
//     this.name = someVar;
//   }
// }
// const extends = new New();

// a) extends - зарезервированное слово, которое 
// нельзя использовать в качестве переменной ------  !!!DONE!!!
// b) extends и New - зарезервированные слова, которые нельзя использовать в качестве переменных
// c) New - зарезервированное слово, которое нельзя использовать в качестве переменной
// d) extends - зарезервированное слово, которое нельзя использовать в качестве переменной, а someVar не передано в качестве аргумента при создании нового объекта


// в ответе a) утверждается, что extends - зарезервированное слово, и так и есть, 
//потому что extends используется при наследовании классов. 
//В ответе b) говорится, что extends и New - зарезервированы, и действительно 
//new зарезервировано, так как используется для инстанцирования классов, 
//но так как JS регистрозависимый, то New не зарезервировано и может 
//использоваться в качестве идентификатора. Соответственно, 
//b) и c) ответы - неправильные. В варианте d) также утверждается, 
//что ошибка из-за того, что не передали someVar в конструктор класса, 
//но если не передать аргумент функции, то он будет иметь значение undefined, 
//но к ошибке не приведет. Итого получается, 
//что единственный правильный вариант - a).


