export const anamorphCatamorph = ''


// Anamorphisms and Catamorphisms
// Анаморфизмы
// Анаморфизмы - это функции, которые преобразуют некоторый объект в более сложную структуру, 
//содержащую тип объекта. Это процесс превращения простой структуры в более сложную. 
//Рассмотрим возможность разворачивания целого числа в список целых чисел. 
//Целое число - это наш исходный объект, а список целых чисел - более сложная структура.

function downToOne(n) {
  const list = [];

  for (let i = n; i > 0; --i) {
    list.push(i);
  }

  return list;
}

downToOne(5)
  //=> [ 5, 4, 3, 2, 1 ]


// Катаморфизмы
// Катаморфизмы противоположны анаморфизмам, поскольку они берут объекты более сложной структуры 
//и складывают их в более простые структуры. Возьмем следующий пример продукта, который 
//принимает список целых чисел и возвращает одно целое число.

function product(list) {
  let product = 1;

  for (const n of list) {
    product = product * n;
  }

  return product;
}

product(downToOne(5)) // 120

//похоже что это не полный пример!!!




