export const benefitsReact = ''


//https://github.com/harryheman/React-Total/blob/main/md/questions_react.md#51
// Какие преимущества предоставляет использование React?
// Вот список основных преимуществ:

// Повышение производительности приложения благодаря виртуальному DOM
// JSX облегчает написание и чтение кода
// Возможность рендеринга как на стороне клиента, так и на стороне сервера
// Возможность относительно простой интеграции с фреймворками (Angular, Backbone), 
//поскольку React - это всего лишь библиотека
// Возможность быстрого юнит и интеграционного тестирования с помощью таких инструментов, как Jest


