export const clientServer = 'https://blog.skillfactory.ru/glossary/rest-api/'


// Каждый объект на сервере в HTTP имеет свой уникальный URL-адрес в строгом последовательном формате. 
//Например, второй модуль обучающего видео про Python будет храниться на сервере 
//по адресу http://school.ru/python/2.

// В REST API есть 4 метода HTTP, которые используют для действий с объектами на серверах:

// GET (получение информации о данных или списка объектов)
// DELETE (удаление данных)
// POST (добавление или замена данных)
// PUT (регулярное обновление данных)
// Такие запросы еще называют идентификаторами CRUD: 
//create (создать), read (прочесть), update (обновить) delete (удалить). 
//Это стандартный набор действий для работы с данными. Например, чтобы обновить видео про 
//Python по адресу http://school.ru/python/2 REST API будет использовать метод PUT, 
//а для его удаления — DELETE.




