export const cookie = 'https://itchief.ru/javascript/cookies'

// https://learn.javascript.ru/cookie

//Cookies - это технология, позволяющая сайтам сохранять в браузере небольшую порцию данных (до 4Кбайт)

// Обычно эти данные используются на сайте для того, чтобы:
// "узнать" (идентифицировать) пользователя (эмулировать постоянное соединение с сервером);
// сохранить информацию о просмотренных страницах или товаров;
// осуществить простую защиту счётчиков и системы голосования от накрутки;
// запомнить настройки интерфейса, расположение блоков, товара, добавленного в корзину и много другого.








