export const funcDeclaration = 'https://learn.javascript.ru/function-expressions'


// Функции – это значения. Они могут быть присвоены, скопированы или объявлены в любом месте кода.
// Если функция объявлена как отдельная инструкция в основном потоке кода, то это Function Declaration.
// Если функция была создана как часть выражения, то считается, что эта функция объявлена 
//при помощи Function Expression.

// Function Declaration обрабатываются перед выполнением блока кода. Они видны во всём блоке.
// Функции, объявленные при помощи Function Expression, создаются, только когда поток выполнения достигает их.

// В большинстве случаев, когда нам нужно создать функцию, предпочтительно использовать Function Declaration, 
//т.к. функция будет видима до своего объявления в коде. Это позволяет более гибко организовывать 
//код и улучшает его читаемость.






import { contents } from "./contents"
