export const iife = 'https://learn.javascript.ru/closure#iife'


// IIFE
// В прошлом в JavaScript не было лексического окружения на уровне блоков кода.
// Так что программистам пришлось что-то придумать. И то, что они сделали, называется 
//«immediately-invoked function expressions» (аббревиатура IIFE), что означает функцию, запускаемую 
//сразу после объявления.

// Это не то, что мы должны использовать сегодня, но, так как вы можете встретить это в старых скриптах, 
//полезно понимать принцип работы.

// IIFE выглядит так:
// (function() {
//   let message = "Hello";
//   alert(message); // Hello
// })();
// Здесь создаётся и немедленно вызывается Function Expression. Так что код выполняется сразу же и у него 
//есть свои локальные переменные.

// Function Expression обёрнуто в скобки (function {...}), потому что, когда JavaScript встречает "function"
// в основном потоке кода, он воспринимает это как начало Function Declaration. Но у Function Declaration 
//должно быть имя, так что такой код вызовет ошибку:

// // Попробуйте объявить и сразу же вызвать функцию
// function() { // <-- Error: Unexpected token (
//   let message = "Hello";
//   alert(message); // Hello
// }();

// Даже если мы скажем: «хорошо, давайте добавим имя», – это не сработает, потому что JavaScript 
//не позволяет вызывать Function Declaration немедленно.

// // ошибка синтаксиса из-за скобок ниже
// function go() {
// }(); // <-- не можете вызывать Function Declaration немедленно
// Так что, скобки вокруг функции – это трюк, который позволяет показать JavaScript, что функция 
//была создана в контексте другого выражения, и, таким образом, это функциональное выражение: 
//ей не нужно имя и её можно вызвать немедленно.

// Кроме скобок, существуют и другие пути показать JavaScript, что мы имеем в виду Function Expression:

// // Пути создания IIFE

// (function() {
//   alert("Скобки вокруг функции");
// })();

// (function() {
//   alert("Скобки вокруг всего");
// }());

// !function() {
//   alert("Выражение начинается с логического оператора NOT");
// }();

// +function() {
//   alert("Выражение начинается с унарного плюса");
// }();
// Во всех перечисленных случаях мы объявляем Function Expression и немедленно выполняем его. 

//Ещё раз заметим, что в настоящий момент нет необходимости писать подобный код.



