export const lifecycleAjax = 'https://habr.com/ru/post/358090/'


// componentDidMount
// Эта функция будет вызвана лишь раз во всем жизненном цикле данного компонента и будет сигнализировать, 
//что компонент и все его дочерние компоненты отрисовались без ошибок.
// Т.к. эта функция гарантирована будет вызвана лишь раз, то это превосходный кандидат для выполнения 
//любых сайд-эффектов, как то AJAX запросы.

// ДЕЛАЙТЕ:
// Выполняйте сайд-эффекты (Вызовы AJAX и т.д.)

// НЕ ДЕЛАЙТЕ:
// Не вызывайте this.setState т.к. это вызовет перерисовку.

// Исключение из правила выше это апдейт состояния, которое базируется на каких-либо DOM свойствах, 
//которые могут вычислены только после того, как компонент перерисовался 
//(например позиция/размеры каких-либо DOM узлов). Но будьте внимательны и предотвращайте повторное 
//обновление если значение фактически не изменилось, т.к. это может привести к циклической перерисовке.


// componentDidUpdate(prevProps, prevState, prevContext)
// Эта функция будет вызываться после того как отработала функция render, в каждом цикле перерисовки. 
//Это означает, что вы можете быть уверены, что компонент и все его дочерние компоненты уже перерисовали себя.
// В связи с этим эта функция является единственной функцией, что гарантировано будет 
//вызвана только раз в каждом цикле перерисовки, поэтому любые сайд-эффекты рекомендуется выполнять 
//именно здесь. Как componentWillUpdate и componentWillRecieveProps в эту функцию передается 
//предыдущие props, состояние (state) и контекст, даже если в этих значениях не было изменений. 
//Поэтому разработчики должны вручную проверять переданные значения на изменения и только потом 
//производить различные апдейт операции.

// componentDidUpdate(prevProps) {
//   if(prevProps.myProps !== this.props.myProp) {
//     // У this.props.myProp изменилось значение
//     // Поэтому мы можем выполнять любые операции для которых
//     // нужны новые значения и/или выполнять сайд-эффекты
//     // вроде AJAX вызовов с новым значением - this.props.myProp
//   }
// }

// ДЕЛАЙТЕ:
// Выполняйте сайд-эффекты (Вызовы AJAX и т.д.)

// НЕ ДЕЛАЙТЕ:
// Не вызывайте this.setState т.к. это будет вызывать циклическую перерисовку.
// Исключение из правила выше это апдейт состояния, которое базируется на каких-либо DOM свойствах, 
//которые могут вычислены только после того, как компонент перерисовался 
//(например позиция/размеры каких-либо DOM узлов). Но будьте внимательны и предотвращайте повторное 
//обновление если значение фактически не изменилось, т.к. это может привести к циклической перерисовке.







