export const pureFunc = 'https://ru.hexlet.io/courses/js-functions/lessons/pure-functions/theory_unit'


// Чистые функции

// Детерминированные функции, напротив, ведут себя предсказуемо. Для одних и тех же входных 
//данных они всегда выдают один и тот же результат. Именно такими являются функции в математике.

// Функция становится недетерминированной и в том случае, если она обращается не 
//только к своим аргументам, но и некоторым внешним данным, например глобальным переменным, 
//переменным окружения и так далее. Так происходит потому, что внешние данные могут измениться, 
//и функция начнёт выдавать другой результат, даже если в неё передаются одни и те же аргументы.

// Идеальная функция с точки зрения удобства работы с ней называется чистой (pure). 
//Чистая функция — это детерминированная функция, которая не производит побочных эффектов. 
//Такая функция зависит только от своих входных аргументов и всегда ведёт себя предсказуемо.

// Чистые функции обладают рядом ключевых достоинств:
// Их просто тестировать. Достаточно передать на вход функции нужные параметры и посмотреть ожидаемый выход.
// Их безопасно запускать повторно, что особенно актуально в асинхронном коде или в случае многопоточного кода.
// Их легко комбинировать, получая новое поведение без необходимости переписывать программу

//Reducer пример чистой ф-ции в React


import { contents } from "./contents"