export const reactRefs = ''


//https://nickbulljs.medium.com/refs-%D0%B2-react-%D0%B2%D1%81%D1%91-%D1%87%D1%82%D0%BE-%D0%BD%D1%83%D0%B6%D0%BD%D0%BE-%D0%B7%D0%BD%D0%B0%D1%82%D1%8C-266a979690f8
// refs используются для получения ссылки на узел DOM (Document Object Model) или компонента в React. 
//Если кратко, то Refs возвращает ссылку на элемент. Почти как в старые добрые getElementById.


// Когда их вообще надо использовать ?
// Желательно никогда. Только, если в них есть необходимость.
// Такая как:
// Фокус элемента, выделение текста.
// Анимации.
// Интеграция с DOM библиотеками.



//Референции можно применять с помощью хука useRef
//пример такого использования
//https://codepen.io/dafen/pen/ZEXMXKe?editors=1011


//те состояния которые мы определяем черех хук useRef они сохраняются между рендерами компонента
// но при этом когда мы меняем сам Реф мы не вызываем рендер компонента
// т.е если мы хотим сохранить чтото между рендерами компонента и не хотим это перерисовывать
//то мы используем Рефы 
// если мы хотим это перерисовывать то мы пользуемся useState





