export const starsJS = 'stars from JS'

// Брендан Айк
// Брендан Айк
// By Darcy Padilla — https://web.archive.org/web/20140209081556/http://blog.mozilla.org/press/bios/brendan-eich/ https://web.archive.org/web/20131108073412/https://blog.mozilla.org/press/files/2012/04/Thumbnail-Full_Eich_04.jpg, CC BY-SA 3.0, Link
// Разработчик JavaScript. Этот язык считается одним из стандартов в WEB-программировании.
// Принимал участие в создании компании Mozilla и браузера Firefox. Занимал пост СЕО. Уволился после скандала, связанного с его позицией по вопросам гей-браков (Брендан – активный участник движения за их запрет в Калифорнии).

// Сэр Тим Бернерс-Ли
// Тим Бернерс-Ли
// Автор фото:
// Paul Clarke
// Автор HTTP протокола, на котором основана работа Интернет. Единственный программист, возведенный в звание рыцаря.
// Сегодня он возглавляет общественную организацию «Альянс за доступный интернет», основная цель которой – доступный и быстрый интернет для всех. Организация пользуется поддержкой крупных корпораций – Google, Microsoft, Facebook.

// Джон Резиг
// Резиг — эксперт в области языка программирования JavaScript и создатель популярной библиотеки в мире jQuery. Он создал многочисленные проекты JavaScript, которые до сих пор остаются неотъемлемой частью современной веб-разработки. В 2005 годуРесиг окончил Рочестерский технологический институт со степенью бакалавра в области информатики. По окончании института он работал над сетями мгновенных сообщений интеллектуального анализа данных и над изучением новых способов поощрения онлайн-сотрудничества в режиме реального времени. На данный момент Джон Резиг является главным архитектором программного обеспечения в Академии Хана, где он работает над предоставлением бесплатного образования.

//Рой Филдинг, один из создателей протокола HTTP.
// У RESTful нет единого стандарта работы: его называют «архитектурным стилем» для операций по работе с серверов. Такой подход в 2000 году в своей диссертации ввел программист и исследователь 
//Рой Филдинг, один из создателей протокола HTTP.



