
/* 
Предлоги места и направления
Предлоги места указывают на положение человека / объекта по отношению к другому человеку / объекту. Предлоги направления, в свою очередь, помогают нам понять как, куда или каким образом движется человек или объект. Выбор таких предлогов зависит, прежде всего, не от окружающих слов, а от того, как говорящий воспринимает ситуацию и расположение объектов в пространстве.
Чаще всего объекты для нас выглядят как: точка (четко ограниченное место или событие, Ex at the theatre – в театре, at a party – на вечеринке), линия (место, которое мы воспринимаем в его протяженности, Ex. along the street – по улице), поверхность (плоское место, площадка, Ex. on the shelf – на полке, across the field – по полю) или объемное пространство (место, которое «включает в себя» или «окружает», Ex in the house – в доме, out of the car – из машины).
Следовательно, говоря об одном и том же месте в пространстве, но воспринимая его по-разному, мы употребляем разные предлоги. Сравните: Brian came to the river. – Брайан подошел к реке (река, как точка, пункт назначения). The mill is down the river. – Мельница находится вниз по реке (река, как линия). The wrecks floated on the river. – Обломки плавали по реке (река, как поверхность). They swam in the river. – Они купались в реке (река как резервуар, аквариум).

Предлоги места: положение объектов (at, in, on, near, between, above)
Предлоги направления: направление и способ движения (to, from, over, across, up, down, out of)
Выбор предлога зависит от того, каким мы видим объект (как точку, линию, поверхность, объемное пространство)   

Madison will meet you in the cafe opposite the hospital. – Медисон встретит тебя в кафе напротив больницы.
The plane flew over the trees. – Самолет пролетел над деревьями.
Jason lives in Brighton / We stopped at Brighton on our way to the beach. – Джейсон живет в Брайтоне / Мы остановились в Брайтоне по дороге на пляж.



Предлоги места: at, in, on, next to, near, by
Хотите сказать, что пришли в магазин / на работу или в какое-то другое место или помещение? Значит, вам не обойтись без предлогов at и in – at the shop, at work. Эти предлоги чаще всего вызывают затруднения в использовании. Предлог at употребляется если предмет или человек находится вблизи какого-либо объекта (at the door – у двери) или же в различных организациях, учреждениях, подразумевая события, которые там происходят (at the airport, at the restaurant).
Нужно настоять, что кто-то или что-то находится внутри помещения? Тогда обязательно – in: They asked me to leave the letter in the office. – Они попросили меня оставить письмо в офисе. Если что-либо находится на чем-либо или прикреплено к поверхности (нам не важно внутри здания или снаружи), нашим предлогом станет on – on the wall, on the first floor – на стене, на первом этаже. Часто on также незаменим, если вы говорите об использовании технологий – on the phone, on the TV, – по телефону, по телевизору.
Как показать, что два объекта находятся недалеко друг от друга? Если между ними нет или практически нет промежутка, тогда – next to (I lived next to my dentist. – Я жил рядом со своим стоматологом). Если же они просто расположены в одной зоне на сравнительно небольшом расстоянии, нужен near: near the ocean – возле океана (относительно недалеко).
Ну, а если совсем рядом или сбоку, тогда – by/beside: Charlotte lives in a cottage by / beside the ocean. – Шарлотта живет в коттедже у океана. (в паре минут ходьбы).

at - в, у – рядом или в учреждении, если говорим о событии, которое там происходит
in - в – расположение внутри помещения или в окружении чего-либо
on - на – расположение на поверхности
next to, near, by, beside – рядом, около – расположение в непосредственной 
близости

He is going to be at the wedding next week. – Он будет на свадьбе на следующей неделе.
It's 11 o'clock, but she is still in the bed. – Уже 11 часов, а она все еще в постели.
Your books are on the table. – Ваши книги лежат на столе.
The dog was walking beside me as we went shopping. – Собака шла рядом, когда мы пошли за покупками.



Предлоги места: between, among, above, over, below, under, in front of, opposite
Чтобы показать, что объект находится между двух других объектов, воспользуйтесь between – between Manchester and Liverpool. – между Манчестером и Ливерпулем. Если же объектов больше чем два, то уместнее выбрать among – The nail was lost among the tools on the floor. – Гвоздь потерялся среди инструментов на полу.
То, что объекты расположены на разном уровне, легко показать с помощью above, over, below, under: above sea level, below ground – выше уровня моря, под землей. При этом, если объект движется вертикально вверх от другого объекта, либо когда объект находится вертикально выше другого объекта, но при этом они не соприкасаются, нужно использовать предлог above: The helicopter is above Prague now. – Вертолет сейчас над Прагой.
А если объекты не только располагаются, а еще и перемещаются горизонтально, либо соприкасаются, то в такой ситуации нам помогут over / under: jump over the fence, slide under the door – перепрыгнуть через забор, пролезть под дверью.
Иногда затруднения могут вызывать также предлоги opposite и in front of. Первый показывает, что два объекта находятся в разных сторонах общего пространства и, скорее всего, между ними расположены какие-то другие объекты: She lives opposite the church – Она живет напротив церкви (между домом и церковью – улица). Второй выражает, что объект находится перед вами: in front of the mirror – перед зеркалом. Противоположным по значению к in front of является behind.

between - между – расположение между двумя людьми / объектами
among - между – расположение между более, чем двумя людьми / объектами
above, over - над – расположение выше уровня чего-либо
below, under – под – расположение ниже уровня чего-либо
opposite – напротив – расположение объектов перед друг другом, но как правило между ними расположено что-то еще
in front of – перед – расположение перед человеком / объектом
behind – за – расположение за человеком / объектом

The English Channel is between England and France. – Пролив Ла-Манш находится между Англией и Францией.
Sophia stood among the crowd. – София стояла в толпе.
She hung a picture above the shelf. – Она повесила картину над полкой.
The river flows under a bridge. – Река протекает под мостом.
The chess players sat opposite each other. – Шахматисты сидели друг напротив друга.
The actor stood in front of the audience. – Актер стоял перед зрителями.
I slowed down my car because there was an ambulance behind me. – Я сбросил скорость, потому что позади меня ехала скорая помощь.



Предлоги направления
Во многих случаях значение английских предлогов направления похоже на значение соответствующих предлогов в русском языке. Например, движение вокруг объекта выражается с помощью предлога around (The cat ran around the table. – Кот бегал вокруг стола), движение через ограниченное пространство – с помощью across (across the border. – через границу), приближение и отдаление от объекта – с помощью to / from (come to another person, a letter from a friend – подойти к другому человеку, письмо от друга), движение из / в помещение – с помощью out of / into (get out of the shadow, come into the room – выйти из тени, зайти в комнату).
Но не всегда значение предлогов совпадает. Так, в русском языке с помощью предлога через обозначается также и движение сквозь закрытое пространство. В английском же языке для обозначения такого движения используется through: through the door – через дверь. В отличие от to, предлог towards выражает не столько приближение к объекту, сколько направленное движение к нему: towards the road – к трассе. Некоторые трудности может вызывать и предлог along, который переводится на русский не только вдоль, но и по: along the street – по улице.

around - вокруг – движение по кругу
across – через, по – движение из одного конца в другой, пересекая поверхность
to / from – к / от – движение к определенной точке / от определенной точки
out of / into – из / в – движение, которое заканчивается вне / внутри объекта
through – через – движение из одного конца в другой, пересекая закрытое пространство
towards – по направлению к – направленное движение к объекту
along – вдоль, по – движение по линии или краю

They sailed around the island. – Они плавали вокруг острова.
The soldiers crawled across the minefield. – Солдаты ползли через минное поле.
Harry removed the toys from the large box. – Гарри забрал игрушки из большой коробки.
The magician climbed out of the burning box. – Фокусник выбрался из горящей коробки.
Jack entered the house through the kitchen window. – Джек попал в дом через кухонное окно.
Turn around and walk with your back towards us. – Повернись и иди спиной к нам.
This fence runs along the border for safety. – Этот забор установлен на границе для обеспечения безопасности.



I could hear voices in the garden this morning.
Этим утром я слышал голоса в саду.

At a wedding, the bride usually stands next to the groom.
На свадьбе невеста обычно стоит рядом с женихом.

If you can't take the heat, get out of the boiler room.
Если не можешь терпеть жару, уходи из коптильни.

We had breakfast on a train.
Мы позавтракали в поезде.

My brother's on the left of my dad in this picture.
На этой фотографии мой брат – слева от отца.

She paused and waved to Paul before getting into the car.
Она остановилась и помахала Полу перед тем, как сесть в машину.





 */



