



// Действие Perfect и Simple

// В русском языке мы привыкли работать с настоящим, прошедшим и будущим временами без всяких заморочек и сложностей. В английском же языке такими временами являются Present, Past и Future Simple – I do, I did и I will do. Никаких сложностей. Но кроме них, в английском, есть I am или was doing или даже I have done, которое и вызывает больше всего сложностей в понимании. I have done – сделала – Present Perfect – настоящее совершенное – время, которое связывает прошлое с настоящим.

// Ну нет в русском языке ничего подобного. Несмотря на то, что Present Perfect — это настоящее время, на русский язык оно переводится прошедшим. Например, I have lost my keys мы переведем как Я потеряла ключи. И именно потеряла, что-то сделала, форма прошедшего времени, и определяет основное значение этого времени — результат, наличие плодов наших действий.

// Но почему тогда настоящее? Да потому, что в предложении важно, где мы видим этот результат. А видим мы его в настоящем — present. Будем видеть в будущем, будет Future Perfect, в прошлом — Past Perfect. Но о них позже.

// I have done – сделал(а) – Present Perfect – настоящее совершенное
// Present Perfect – результат в настоящем
// I have lost my keys. I can't get into my house. –  Я потеряла ключи. Я не могу попасть в дом.
// They have come too early and now they have to wait. – Они пришли слишком рано и им сейчас приходится ждать.



// I have done. Use

// Итак, I have lost my keys. В этом предложении само действие уже закончилось (совершилось), но от него остался в настоящем времени результат — я переживаю, где я могла их потерять, вспоминаю, где видела их в последний раз, в конце концов стою перед закрытой дверью квартиры и не могу попасть внутрь.
// И видите, что нет уточнения, когда именно произошло действие вчера или позавчера, потому что в центре внимания у нас то, что происходит сейчас. I have bought a new dress. – Я купила новое платье.
// Приходите домой и хвастаетесь красивым модным платьем. И что? Важно, когда вы его купили. Нет. Будет столь важно, скажете. Но сейчас-то в центре внимания вы в новом платье. Поэтому нужно запомнить, что в английском языке эти действия потеряла, купила – сделала или не сделала что-то воспринимаются как действия из настоящего, так как важны нам именно здесь, а не где-то там и когда-то тогда.

// I have done – действие свершилось, результат в настоящем
// I have done – сделал(а) без уточнения когда именно
// I have done – сделал(а) и это важно здесь и сейчас
// I have bought a new dress. Look at me! – Я купила новое платье. Посмотри на меня!
// Here is my CD! I have just burnt it. – Вот мой CD! Я только что его записала.
// He has not listened to your album today yet. – Он не слушал еще ваш альбом сегодня.



// I have done и I did. Различия
// А вот если важно будет действие, которое произошло когда-то тогда и где-то там, в прошлом - вчера, позавчера, 10 лет назад, когда уже все и забыли что и как было - тогда форма I did она же Past Simple. I lost my keys a week ago. I bought a new dress last Saturday. Но кому это уже так интересно? Это же вам не I have bought a new dress. Посмотрите, какая я красивая в новом платье.
// Present Perfect — это все-таки больше настоящее время. Англичане совершенно не воспринимают его как прошлое. Они ведь не знают, что на русский язык мы переводим have done как прошедшее – сделал / сделала. Давайте пощадим их уши.

// I have done – сделал(а) и не важно, когда именно
// I did yesterday – сделал(а) вчера – важно, когда именно
// I did – слова-маркеры: yesterday, last Monday / month / year / century, ...ago
// I have bought a new dress. I'm so happy! – Я купила новое платье. Я так счастлива!
// I bought a new dress last Saturday. – Я купила новое платье в прошлую субботу.
// Did you see me in my new dress at the party yesterday? – Ты видел меня в новом платье вчера на вечеринке?


// I have done и I did. Слова-маркеры
// В английском языке, чтобы легче было разобраться, где нужно I did, а где I have done, есть четкие показатели и подсказки для обоих времен. Для Past Simple это yesterday, потом last week / month – в общем все выражения со словом прошлый – last, а также ...ago.
// Как только увидите в предложении подобную информацию — форма I did (Past Simple). She came home late yesterday. Для Present Perfect — это just, already / yet, recently / lately, т.е. без всякой привязки к прошлому. She has already come.
// I have done / I did yesterday – Я сделал(а) / Я сделал(а) вчера
// I have done: just, already / yet, recently / lately
// I did: yesterday, last Monday/month/year/century, ...ago
// She has already come. Talk to her! – Она уже пришла. Поговорите с ней!
// She came home late yesterday. – Она вчера поздно пришла домой.
// I wrote this song two minutes ago. – Я написал эту песню две минуты назад.



