



/* 

Читайте только очень громко! Переход с громкого говорения на тихое очень легок и прост, но переход с тихого говорения на громкое с сохранением при этом должного произношения очень и очень затруднен и даже невозможен. В постановке правильного произношения это правило является не просто чрезвычайно важным, но краеугольным! Таким образом, кстати, происходит и постановка профессионального голоса у актеров. Повторю еще раз:
ВЫ ДОЛЖНЫ НАЧИТЫВАТЬ ВАШИ МАТРИЧНЫЕ ДИАЛОГИ ТОЛЬКО ОЧЕНЬ ГРОМКИМ ГОЛОСОМ!

И не забывайте дышать! Да, да, дышать – я хотел сказать именно это! Когда вы начинаете говорить на иностранном языке, ваше дыхание сбивается. При отличной от вашего родного языка артикуляции, вы должны также по-другому дышать. Новые алгоритмы работы диафрагмы и легких значительно отличаются от старых – вы должны отдавать себе в этом отчет. Не удивляйтесь тому, что при отработке матричных диалогов вы будете несколько задыхаться – только вначале, но постепенно ваше дыхание должно настроиться, и вы задышите, так сказать, «по-иностранному»…





*/







